citizen4503/STM32-geiger/firmware/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define BTN1_Pin GPIO_PIN_14
#define BTN1_GPIO_Port GPIOB
#define BTN2_Pin GPIO_PIN_15
#define BTN2_GPIO_Port GPIOB
#define STS5_Pin GPIO_PIN_8
#define STS5_GPIO_Port GPIOA
#define STS5_EXTI_IRQn EXTI9_5_IRQn
#define LCD_RST_Pin GPIO_PIN_9
#define LCD_RST_GPIO_Port GPIOA
#define LCD_CE_Pin GPIO_PIN_10
#define LCD_CE_GPIO_Port GPIOA
#define LCD_DC_Pin GPIO_PIN_11
#define LCD_DC_GPIO_Port GPIOA
#define LCD_DIN_Pin GPIO_PIN_12
#define LCD_DIN_GPIO_Port GPIOA
#define LCD_CLK_Pin GPIO_PIN_15
#define LCD_CLK_GPIO_Port GPIOA
#define LCD_LIGHT_Pin GPIO_PIN_3
#define LCD_LIGHT_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
/* Counter variable for STS5 impulses */
uint32_t sts5_counter;
uint32_t sts5_counter_minute;
uint32_t sts5_counter_second;
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
